blog/rio-en.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-02-15 Sat 22:19 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Porting to Rio</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Colin" />
<link rel="stylesheet" type="text/css" href="../assets/org-theme.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Porting to Rio</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orge4130e1">1. What is Rio?</a></li>
<li><a href="#org2e30db1">2. The Porting Experience</a>
<ul>
<li><a href="#org9875313">2.1. The Prelude Swap</a></li>
<li><a href="#org20b80e0">2.2. Extensible Effects</a></li>
<li><a href="#org801b350">2.3. Logging</a></li>
</ul>
</li>
<li><a href="#org4e355ab">3. Should you use it?</a></li>
</ul>
</div>
</div>
<p>
<a href="https://github.com/fosskers/aura">Aura</a> has long been my den for mad science in Haskell. Whenever some new library
or technique comes along, I give it a try to get a feel for its true usefulness.
The discussion around Extensible Effects (and application monads in general) has
been on my radar for a long time, and let me tell you, I've followed the whole
story. The timeline for Aura's approach to effects is something like this:
</p>

<ul class="org-ul">
<li>2012: I've never heard of Monad Transformers, and pass a runtime <code>Env</code>
manually everywhere. Everything is <code>IO</code>.</li>
<li>2013: The <code>Aura</code> Monad is born (<code>ExceptT</code> over <code>ReaderT</code> over <code>IO</code>). Thank you
<i>Real World Haskell</i>!</li>
<li>2015: The <a href="http://okmij.org/ftp/Haskell/extensible/exteff.pdf">Extensible Effects</a> paper is released and we <a href="https://github.com/fosskers/aura/pull/379">attempt a first pass</a> at using it.</li>
<li>2016: I <a href="https://www.meetup.com/Vancouver-Haskell-Unmeetup/events/229599314">give a talk</a> on Extensible Effects to a local Haskell group.</li>
<li>2018: Aura <a href="https://github.com/fosskers/aura/pull/479">moves to</a> <code>freer-simple</code> instead. No more <code>Aura</code> monad.</li>
<li>2019: Joe <a href="https://github.com/fosskers/aura/pull/524">ports Aura</a> to <code>fused-effects</code> with much effort.</li>
<li>2020: I realize we were trying too hard and <a href="https://github.com/fosskers/aura/pull/535">port Aura to use Rio</a>.</li>
</ul>

<p>
Yes, <a href="http://hackage.haskell.org/package/rio">Rio</a>! And I should say, the process was quite pleasant. I'm happy with the
switch.
</p>

<div id="outline-container-orge4130e1" class="outline-2">
<h2 id="orge4130e1"><span class="section-number-2">1</span> What is Rio?</h2>
<div class="outline-text-2" id="text-1">
<p>
Rio is a "batteries included" alternate Prelude. I usually reach for
<code>base-prelude</code> for applications, since it stays out of the way and satisfies my
main requirement:
</p>

<blockquote>
<p>
Give me access to everything in base that I'm going to be importing anyway!
</p>
</blockquote>

<p>
I'm looking at you, <code>traverse_</code>.
</p>

<p>
Rio fills this requirement for me, but also goes a few steps further to make it
an ideal choice for terminal-based Haskell applications, which is exactly what
Aura is. It gives us:
</p>

<ul class="org-ul">
<li>A dead-simple logging system with sensible defaults.</li>
<li>Access to the major data types we use anyway (<code>Vector</code>, <code>HashMap</code>, etc.)
without needing to depend on their libraries ourselves.</li>
<li>Access to the <i>symbols</i> of those datatypes without adding imports. <code>Text</code>,
etc., are freely available, so no more <code>import Data.Text (Text)</code> just to avoid
the ugly qualified <code>T.Text</code> everywhere.</li>
<li>An "opt-in" approach to non-total functions via modules like <code>RIO.List.Partial</code>.</li>
<li>Sensible defaults for file IO and character encodings.</li>
<li>The <code>RIO</code> effect monad (<code>ReaderT IO</code>) with many convenience functions involving it.</li>
</ul>
</div>
</div>

<div id="outline-container-org2e30db1" class="outline-2">
<h2 id="org2e30db1"><span class="section-number-2">2</span> The Porting Experience</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org9875313" class="outline-3">
<h3 id="org9875313"><span class="section-number-3">2.1</span> The Prelude Swap</h3>
<div class="outline-text-3" id="text-2-1">
<p>
A naive replacement of <code>base-prelude</code> for <code>rio</code> went well. Mostly a
find-and-replace of import statements.
</p>

<p>
When it came to ditching <code>text</code> and <code>bytestring</code> in favour of what <code>rio</code>
reexports, I had to reconcile some things which weren't at first intuitive. For
instance: <code>rio</code> exposes no way to output <code>Text</code>, say via <code>T.putStrLn</code>. It
recommends we go through <code>ByteString</code>, or through its <code>Display</code> typeclass which
is optimized for Rio's logging. At first this bothered me, but now I'm okay with
it. If you just want simple trace statements for debugging, Rio supplies plenty
of those.
</p>

<p>
List is not given special treatment, so even functions like <code>zip</code> aren't exposed
without importing <code>RIO.List</code>. I personally like that List has been "knocked down
a peg" in this way.
</p>

<p>
A few reexports functions <code>microlens</code> were missing, so I needed to pull those
myself. <code>Data.Bifunctor</code> is also not reexported, so <code>first</code> and <code>second</code> still
come from <code>Control.Arrow</code>.
</p>

<p>
My <code>aura.cabal</code> got nicely reduced, since there's no need to depend on packages
like <code>containers</code>, <code>bytestring</code>, etc. The overall line count of the code dropped
by a nice amount too due to cleaner imports and type signatures. Speaking of
which&#x2026;
</p>
</div>
</div>

<div id="outline-container-org20b80e0" class="outline-3">
<h3 id="org20b80e0"><span class="section-number-3">2.2</span> Extensible Effects</h3>
<div class="outline-text-3" id="text-2-2">
<p>
I can't overstate how removing these in favour of <code>RIO Env a</code> simplified my
life. Look at this diff:
</p>

<div class="org-src-container">
<pre class="src src-diff"><span style="color: #f2241f;">-</span><span style="color: #dc752f;"> </span><span style="color: #f2241f;">installPkgFiles</span><span style="color: #dc752f;"> </span><span style="color: #f2241f;">::</span><span style="color: #dc752f;"> </span><span style="color: #f2241f;">(Carrier</span><span style="color: #dc752f;"> </span><span style="color: #f2241f;">sig</span><span style="color: #dc752f;"> </span><span style="color: #f2241f;">m,</span><span style="color: #dc752f;"> </span><span style="color: #f2241f;">Member</span><span style="color: #dc752f;"> </span><span style="color: #f2241f;">(Reader</span><span style="color: #dc752f;"> </span><span style="color: #f2241f;">Env)</span><span style="color: #dc752f;"> </span><span style="color: #f2241f;">sig,</span><span style="color: #dc752f;"> </span><span style="color: #f2241f;">Member</span><span style="color: #dc752f;"> </span><span style="color: #f2241f;">(Error</span><span style="color: #dc752f;"> </span><span style="color: #f2241f;">Failure)</span><span style="color: #dc752f;"> </span><span style="color: #f2241f;">sig,</span><span style="color: #dc752f;"> </span><span style="color: #f2241f;">Member</span><span style="color: #dc752f;"> </span><span style="color: #f2241f;">(Lift</span><span style="color: #dc752f;"> </span><span style="color: #f2241f;">IO)</span><span style="color: #dc752f;"> </span><span style="color: #f2241f;">sig)</span><span style="color: #dc752f;"> </span><span style="color: #f2241f;">=&gt;</span>
<span style="color: #f2241f;">-</span><span style="color: #dc752f;">   </span><span style="color: #f2241f;">NESet</span><span style="color: #dc752f;"> </span><span style="color: #f2241f;">PackagePath</span><span style="color: #dc752f;"> </span><span style="color: #f2241f;">-&gt;</span><span style="color: #dc752f;"> </span><span style="color: #f2241f;">m</span><span style="color: #dc752f;"> </span><span style="color: #f2241f;">()</span>
+<span style="color: #dc752f;"> </span>installPkgFiles<span style="color: #dc752f;"> </span>::<span style="color: #dc752f;"> </span>NESet<span style="color: #dc752f;"> </span>PackagePath<span style="color: #dc752f;"> </span>-&gt;<span style="color: #dc752f;"> </span>RIO<span style="color: #dc752f;"> </span>Env<span style="color: #dc752f;"> </span>()
</pre>
</div>

<p>
This port PR was filled with lines like this, and each one gave me joy. Yes we
lose the explicit <code>Error</code> effect, but this is Haskell, where <code>IO</code> can throw
exceptions anyway. It's a wart I'm willing to accept in order to have access the
other amazing things that Haskell gives me. Suffice to say I gave my <code>Failure</code>
type an <code>Exception</code> instance and now throw that as needed (which isn't often).
</p>

<p>
Now, here's the conclusion I've come to regarding regarding Extensible Effects:
somebody somewhere has a use case that benefits from Extensible Effects. That
person is not you. Recognize when you're trying too hard just to do a novel
thing for novelty's sake.
</p>
</div>
</div>

<div id="outline-container-org801b350" class="outline-3">
<h3 id="org801b350"><span class="section-number-3">2.3</span> Logging</h3>
<div class="outline-text-3" id="text-2-3">
<p>
Aura doesn't use Rio's logging system, but <a href="https://github.com/kadena-io/chainweb-miner">another project of mine</a> does. Here is
the simplest form I could reduce the setup boilerplate to:
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #4f97d7; font-weight: bold;">import</span> <span style="color: #ce537a; font-weight: bold;">Data.Generics.Produce.Fields</span> <span style="color: #4f97d7;">(</span>field<span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7; font-weight: bold;">import</span> <span style="color: #ce537a; font-weight: bold;">RIO</span>

<span style="color: #4f97d7; font-weight: bold;">data</span> <span style="color: #ce537a; font-weight: bold;">Env</span> <span style="color: #7590db;">=</span> <span style="color: #ce537a; font-weight: bold;">Env</span> <span style="color: #4f97d7;">{</span> envLog <span style="color: #7590db;">::</span> <span style="color: #ce537a; font-weight: bold;">LogFunc</span>, <span style="color: #7590db;">...</span> <span style="color: #4f97d7;">}</span>
  <span style="color: #4f97d7; font-weight: bold;">deriving</span> <span style="color: #4f97d7; font-weight: bold;">stock</span> <span style="color: #4f97d7;">(</span><span style="color: #ce537a; font-weight: bold;">Generic</span><span style="color: #4f97d7;">)</span>

<span style="color: #9f8766;">-- | The only "glue" that ends up being necessary.</span>
<span style="color: #9f8766;">-- `field` is from generic-lens.</span>
<span style="color: #4f97d7; font-weight: bold;">instance</span> <span style="color: #ce537a; font-weight: bold;">HasLogFunc</span> <span style="color: #ce537a; font-weight: bold;">Env</span> <span style="color: #4f97d7; font-weight: bold;">where</span>
  logFuncL <span style="color: #7590db;">=</span> field <span style="color: #7590db;">@</span><span style="color: #2d9574;">"envLog"</span>

<span style="color: #bc6ec5; font-weight: bold;">main</span> <span style="color: #7590db;">::</span> <span style="color: #ce537a; font-weight: bold;">IO</span> <span style="color: #4f97d7; font-weight: bold;">()</span>
<span style="color: #bc6ec5; font-weight: bold;">main</span> <span style="color: #7590db;">=</span> <span style="color: #4f97d7; font-weight: bold;">do</span>
  lopts <span style="color: #7590db;">&lt;-</span> setLogUseLoc <span style="color: #ce537a; font-weight: bold;">False</span> <span style="color: #7590db;">&lt;$&gt;</span> logOptionsHandle stderr <span style="color: #ce537a; font-weight: bold;">True</span>
  withLogFunc lopts <span style="color: #7590db;">$</span> <span style="color: #7590db;">\</span>logFunc <span style="color: #7590db;">-&gt;</span> <span style="color: #4f97d7; font-weight: bold;">do</span>
    <span style="color: #4f97d7; font-weight: bold;">let</span> <span style="color: #7590db;">!</span>env <span style="color: #7590db;">=</span> <span style="color: #ce537a; font-weight: bold;">Env</span> logFunc <span style="color: #7590db;">...</span>
    runRIO env work

<span style="color: #bc6ec5; font-weight: bold;">work</span> <span style="color: #7590db;">::</span> <span style="color: #ce537a; font-weight: bold;">RIO</span> <span style="color: #ce537a; font-weight: bold;">Env</span> <span style="color: #4f97d7; font-weight: bold;">()</span>
<span style="color: #bc6ec5; font-weight: bold;">work</span> <span style="color: #7590db;">=</span> <span style="color: #4f97d7; font-weight: bold;">do</span>
  logInfo <span style="color: #2d9574;">"It works!"</span>
</pre>
</div>

<p>
It just works.
</p>
</div>
</div>
</div>

<div id="outline-container-org4e355ab" class="outline-2">
<h2 id="org4e355ab"><span class="section-number-2">3</span> Should you use it?</h2>
<div class="outline-text-2" id="text-3">
<p>
If your Haskell program runs from the terminal and has a runtime environment
type, then Rio would bring you a lot of value. If you need a logging system too,
then Rio really simplifies your life. In general, it will clean up your imports
and your type signatures, and it just keeps things simple.
</p>

<p>
Otherwise, if you're just looking for an Alternate Prelude, then any other one
will do. Rio shines when you use it for what it's meant for.
</p>

<p>
Thanks to Michael and everyone behind <code>rio</code>! Consider me a happy customer.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2020-02-15</p>
<p class="author">Author: Colin</p>
<p class="date">Created: 2020-02-15 Sat 22:19</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
